# Operations

In [34]:
import numpy as np
import pandas as pd
df=pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [35]:
#head:上から５個のデータを取得する
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [36]:
#tail:下から５個のデータを取得する
df.tail()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

# Info on Uniqye Values

In [37]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [38]:
df['col2'].nunique()

3

In [39]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

# Selecting Data

### select from Dataframes using conditions from multiple coulmns

In [40]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [41]:
newdf=df[(df['col1']>2) & (df['col2']==444)]

In [42]:
newdf

   col1  col2 col3
3     4   444  xyz

# Applying Functions

In [43]:
def times2(x):
    return x*2

In [44]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [45]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [46]:
df['col1'].sum()

10

### **Permanently Removing a Column**

In [52]:
del df['col1']
df

KeyError: 'col1'

In [53]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [54]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [55]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [58]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [61]:
df.sort_values(by='col3')

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

# Find Null Valuer or Check for Null Values

In [63]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [64]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

# Filling in Nan values with something else

In [66]:
df=pd.DataFrame({
    'col1':[1,2,3,np.nan],
    'col2':[np.nan,555,666,444],
    'col3':['abc','def','ghi','xyz']
})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [67]:
df.fillna('Lohit')

    col1   col2 col3
0      1  Lohit  abc
1      2    555  def
2      3    666  ghi
3  Lohit    444  xyz

In [68]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [69]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
    'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)

In [70]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [72]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN